{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies('55777937-2420-4dcf-88f4-4fd7b87ccff8')/settings(settingDefinitions())",
    "@odata.count": 19,
    "value": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "fb2f16e0-2804-45a0-9982-fe709d59fef8"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "e9f334db-ca88-4b09-9ccf-d7b9b3142210",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_extensioninstallblocklistdesc",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "26c1a943-562d-4286-b5ff-4b491b9515bc"
                            },
                            "simpleSettingCollectionValue": [
                                {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "*"
                                }
                            ]
                        }
                    ]
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "ExtensionInstallBlocklist",
                        "Control which extensions cannot be installed",
                        "\\Microsoft Edge\\Extensions",
                        "Microsoft Edge\\Extensions",
                        "Extensions"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~Extensions/ExtensionInstallBlocklist",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
                    "categoryId": "66615d2a-fec9-47f1-8eaf-9813e30cc023",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
                    "description": "List specific extensions that users can NOT install in Microsoft Edge. When you deploy this policy, any extensions on this list that were previously installed will be disabled, and the user won't be able to enable them. If you remove an item from the list of blocked extensions, that extension is automatically re-enabled anywhere it was previously installed.\r\n\r\nUse \"*\" to block all extensions that aren't explicitly listed in the allow list.\r\n\r\nIf you don't configure this policy, users can install any extension in Microsoft Edge.\r\n\r\nExample value:\r\n\r\nextension_id1\r\nextension_id2",
                    "helpText": "",
                    "name": "ExtensionInstallBlocklist",
                    "displayName": "Control which extensions cannot be installed",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": [
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_extensioninstallblocklistdesc",
                                    "required": true
                                }
                            ]
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "ExtensionInstallBlocklist",
                        "Control which extensions cannot be installed",
                        "\\Microsoft Edge\\Extensions",
                        "Microsoft Edge\\Extensions",
                        "Extensions"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~Extensions/ExtensionInstallBlocklist",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist",
                    "categoryId": "66615d2a-fec9-47f1-8eaf-9813e30cc023",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_extensioninstallblocklistdesc",
                    "description": "",
                    "helpText": "",
                    "name": "ExtensionInstallBlocklistDesc",
                    "displayName": "Extension IDs the user should be prevented from installing (or * for all) (Device)",
                    "version": "638917477006998785",
                    "defaultValue": null,
                    "maximumCount": 1000,
                    "minimumCount": 1,
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
                        "format": "none",
                        "inputValidationSchema": null,
                        "maximumLength": 2048,
                        "minimumLength": 0,
                        "isSecret": false,
                        "fileTypes": []
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist_1",
                            "parentSettingId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~extensions_extensioninstallblocklist"
                        }
                    ],
                    "dependedOnBy": []
                }
            ]
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "905d4bdc-0216-4ad9-a5b8-6254fa8c914b"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "03f73d3f-e150-45b3-9d2e-bac7ab998e54",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "BasicAuthOverHttpEnabled",
                        "Allow Basic authentication for HTTP",
                        "\\Microsoft Edge\\HTTP authentication",
                        "Microsoft Edge\\HTTP authentication",
                        "HTTP authentication"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev88.0.705.23~Policy~microsoft_edge~HTTPAuthentication/BasicAuthOverHttpEnabled",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled",
                    "categoryId": "d17b08e6-de3b-445b-ab14-1d47e62efdcf",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled",
                    "description": "If you enable this policy or leave it unset, Basic authentication challenges received over non-secure HTTP will be allowed.\r\n\r\nIf you disable this policy,  non-secure HTTP requests from the Basic authentication scheme are blocked, and only secure HTTPS is allowed.\r\n\r\nThis policy setting is ignored (and Basic is always forbidden) if the 'AuthSchemes' (Supported authentication schemes) policy is set and does not include Basic.",
                    "helpText": "",
                    "name": "BasicAuthOverHttpEnabled",
                    "displayName": "Allow Basic authentication for HTTP",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev88.0.705.23~policy~microsoft_edge~httpauthentication_basicauthoverhttpenabled_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "2",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "ed7bb376-0861-4ed0-9a65-49c770373d2e"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "52012daa-f831-48ad-a327-5c1be8810e16",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_authschemes",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "7e9d11fe-3d61-4a22-8ed8-6480473faec5"
                            },
                            "simpleSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "value": "ntlm,negotiate",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "53d26350-fd8d-4a2e-9ef0-a6cd77217dea",
                                    "useTemplateDefault": false
                                }
                            }
                        }
                    ]
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "AuthSchemes",
                        "Supported authentication schemes",
                        "\\Microsoft Edge\\HTTP authentication",
                        "Microsoft Edge\\HTTP authentication",
                        "HTTP authentication"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~HTTPAuthentication/AuthSchemes",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
                    "categoryId": "d17b08e6-de3b-445b-ab14-1d47e62efdcf",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
                    "description": "Specifies which HTTP authentication schemes are supported.\r\n\r\nYou can configure the policy by using these values: 'basic', 'digest', 'ntlm', and 'negotiate'. Separate multiple values with commas.\r\n\r\nIf you don't configure this policy, all four schemes are used.\r\n\r\nExample value: basic,digest,ntlm,negotiate",
                    "helpText": "",
                    "name": "AuthSchemes",
                    "displayName": "Supported authentication schemes",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": [
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_authschemes",
                                    "required": true
                                }
                            ]
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "AuthSchemes",
                        "Supported authentication schemes",
                        "\\Microsoft Edge\\HTTP authentication",
                        "Microsoft Edge\\HTTP authentication",
                        "HTTP authentication"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~HTTPAuthentication/AuthSchemes",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes",
                    "categoryId": "d17b08e6-de3b-445b-ab14-1d47e62efdcf",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_authschemes",
                    "description": "",
                    "helpText": "",
                    "name": "AuthSchemes",
                    "displayName": "Supported authentication schemes (Device)",
                    "version": "638917477006998785",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "valueDefinition": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValueDefinition",
                        "format": "none",
                        "inputValidationSchema": null,
                        "maximumLength": 1000000,
                        "minimumLength": 0,
                        "isSecret": false,
                        "fileTypes": []
                    },
                    "defaultValue": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                        "settingValueTemplateReference": null,
                        "value": null
                    },
                    "dependentOn": [
                        {
                            "dependentOn": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes_1",
                            "parentSettingId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~httpauthentication_authschemes"
                        }
                    ],
                    "dependedOnBy": []
                }
            ]
        },
        {
            "id": "3",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "9bcc84e8-0053-493a-a87e-08d84e0967fa"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "f312fe01-d3f1-4716-ac3a-1ead051efef0",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "NativeMessagingUserLevelHosts",
                        "Allow user-level native messaging hosts (installed without admin permissions)",
                        "\\Microsoft Edge\\Native Messaging",
                        "Microsoft Edge\\Native Messaging",
                        "Native Messaging"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~NativeMessaging/NativeMessagingUserLevelHosts",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts",
                    "categoryId": "ef8760ac-a77c-4055-a812-a95bfbf9c00a",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts",
                    "description": "Enables user-level installation of native messaging hosts.\r\n\r\nIf you disable this policy, Microsoft Edge will only use native messaging hosts installed on the system level.\r\n\r\nBy default, if you don't configure this policy, Microsoft Edge will allow usage of user-level native messaging hosts.",
                    "helpText": "",
                    "name": "NativeMessagingUserLevelHosts",
                    "displayName": "Allow user-level native messaging hosts (installed without admin permissions)",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~nativemessaging_nativemessaginguserlevelhosts_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "4",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "45407a86-95c9-4968-af31-4038faabcc1c"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "e7a7bf01-efb1-4f11-8904-a3fb36b589bf",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "InsecurePrivateNetworkRequestsAllowed",
                        "Specifies whether to allow insecure websites to make requests to more-private network endpoints",
                        "\\Microsoft Edge\\Private Network Request Settings",
                        "Microsoft Edge\\Private Network Request Settings",
                        "Private Network Request Settings"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev92~Policy~microsoft_edge~PrivateNetworkRequestSettings/InsecurePrivateNetworkRequestsAllowed",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed",
                    "categoryId": "43057320-7058-46d5-86f9-a56c80bbf8b9",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed",
                    "description": "Controls whether insecure websites are allowed to make requests to more-private network endpoints.\r\n\r\nThis policy relates to the CORS-RFC1918 specification. See https://wicg.github.io/cors-rfc1918 for more details.\r\n\r\nA network endpoint is more private than another if:\r\n1) Its IP address is localhost and the other is not.\r\n2) Its IP address is private and the other is public.\r\nIn the future, depending on spec evolution, this policy might apply to all cross-origin requests directed at private IPs or localhost.\r\n\r\nA website is deemed secure if it meets the definition of a secure context in https://developer.mozilla.org/en-US/docs/Web/Security/Secure_Contexts. Otherwise, it will be treated as an insecure context.\r\n\r\nWhen this policy is either not set or set to false, the default behavior for requests from insecure contexts to more-private network endpoints will depend on the user's personal configuration for the BlockInsecurePrivateNetworkRequests feature, which may be set by a field trial or on the command line.\r\n\r\nWhen this policy is set to true, insecure websites are allowed to make requests to any network endpoint, subject to other cross-origin checks.",
                    "helpText": "",
                    "name": "InsecurePrivateNetworkRequestsAllowed",
                    "displayName": "Specifies whether to allow insecure websites to make requests to more-private network endpoints",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge~privatenetworkrequestsettings_insecureprivatenetworkrequestsallowed_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "5",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "b8ed5ae9-d2aa-45ee-9a54-022ad4e0966b"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "6de4eabb-5e3d-45e0-a74c-6f9d810182c4",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "SmartScreenEnabled",
                        "Configure Microsoft Defender SmartScreen",
                        "\\Microsoft Edge\\SmartScreen settings",
                        "Microsoft Edge\\SmartScreen settings",
                        "SmartScreen settings"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~SmartScreen/SmartScreenEnabled",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled",
                    "categoryId": "08c5f391-e156-4a72-bbb9-3670f2f63a56",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled",
                    "description": "This policy setting lets you configure whether to turn on Microsoft Defender SmartScreen. Microsoft Defender SmartScreen provides warning messages to help protect your users from potential phishing scams and malicious software. By default, Microsoft Defender SmartScreen is turned on.\r\n\r\nIf you enable this setting, Microsoft Defender SmartScreen is turned on.\r\n\r\nIf you disable this setting, Microsoft Defender SmartScreen is turned off.\r\n\r\nIf you don't configure this setting, users can choose whether to use Microsoft Defender SmartScreen.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.",
                    "helpText": "",
                    "name": "SmartScreenEnabled",
                    "displayName": "Configure Microsoft Defender SmartScreen",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "6",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "2a7c641e-09a9-4746-aea3-a773ff63ac28"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "86f52c99-3b8f-4196-b481-8ce9c6c5adfd",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "SmartScreenPuaEnabled",
                        "Configure Microsoft Defender SmartScreen to block potentially unwanted apps",
                        "\\Microsoft Edge\\SmartScreen settings",
                        "Microsoft Edge\\SmartScreen settings",
                        "SmartScreen settings"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev80diff~Policy~microsoft_edge~SmartScreen/SmartScreenPuaEnabled",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled",
                    "categoryId": "08c5f391-e156-4a72-bbb9-3670f2f63a56",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled",
                    "description": "This policy setting lets you configure whether to turn on blocking for potentially unwanted apps with Microsoft Defender SmartScreen. Potentially unwanted app blocking with Microsoft Defender SmartScreen provides warning messages to help protect users from adware, coin miners, bundleware, and other low-reputation apps that are hosted by websites. Potentially unwanted app blocking with Microsoft Defender SmartScreen is turned off by default.\r\n\r\nIf you enable this setting, potentially unwanted app blocking with Microsoft Defender SmartScreen is turned on.\r\n\r\nIf you disable this setting, potentially unwanted app blocking with Microsoft Defender SmartScreen is turned off.\r\n\r\nIf you don't configure this setting, users can choose whether to use potentially unwanted app blocking with Microsoft Defender SmartScreen.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.",
                    "helpText": "",
                    "name": "SmartScreenPuaEnabled",
                    "displayName": "Configure Microsoft Defender SmartScreen to block potentially unwanted apps",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "7",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "94294557-f4af-49da-b7c8-9ef4a7d9319b"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "953e6274-422c-4fd4-be5b-9a33ec2fd86b",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "PreventSmartScreenPromptOverride",
                        "Prevent bypassing Microsoft Defender SmartScreen prompts for sites",
                        "\\Microsoft Edge\\SmartScreen settings",
                        "Microsoft Edge\\SmartScreen settings",
                        "SmartScreen settings"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~SmartScreen/PreventSmartScreenPromptOverride",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride",
                    "categoryId": "08c5f391-e156-4a72-bbb9-3670f2f63a56",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride",
                    "description": "This policy setting lets you decide whether users can override the Microsoft Defender SmartScreen warnings about potentially malicious websites.\r\n\r\nIf you enable this setting, users can't ignore Microsoft Defender SmartScreen warnings and they are blocked from continuing to the site.\r\n\r\nIf you disable or don't configure this setting, users can ignore Microsoft Defender SmartScreen warnings and continue to the site.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.",
                    "helpText": "",
                    "name": "PreventSmartScreenPromptOverride",
                    "displayName": "Prevent bypassing Microsoft Defender SmartScreen prompts for sites",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "8",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "32bab315-ed28-4b2f-8925-cfdead92ab2d"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "5ed5e40a-f8d0-4bb7-a3b2-40af75098591",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "PreventSmartScreenPromptOverrideForFiles",
                        "Prevent bypassing of Microsoft Defender SmartScreen warnings about downloads",
                        "\\Microsoft Edge\\SmartScreen settings",
                        "Microsoft Edge\\SmartScreen settings",
                        "SmartScreen settings"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge~SmartScreen/PreventSmartScreenPromptOverrideForFiles",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles",
                    "categoryId": "08c5f391-e156-4a72-bbb9-3670f2f63a56",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles",
                    "description": "This policy lets you determine whether users can override Microsoft Defender SmartScreen warnings about unverified downloads.\r\n\r\nIf you enable this policy, users in your organization can't ignore Microsoft Defender SmartScreen warnings, and they're prevented from completing the unverified downloads.\r\n\r\nIf you disable or don't configure this policy, users can ignore Microsoft Defender SmartScreen warnings and complete unverified downloads.\r\n\r\nThis policy is available only on Windows instances that are joined to a Microsoft Active Directory domain; or on Windows 10 Pro or Enterprise instances that are enrolled for device management.",
                    "helpText": "",
                    "name": "PreventSmartScreenPromptOverrideForFiles",
                    "displayName": "Prevent bypassing of Microsoft Defender SmartScreen warnings about downloads",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "9",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "7a2df044-f9ff-4f9e-9bc8-175f4429525f"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "13542032-04ea-4bcb-9ea5-e59123d31d2e",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "TyposquattingCheckerEnabled",
                        "Configure Edge TyposquattingChecker",
                        "Configure Edge Website Typo Protection",
                        "\\Microsoft Edge\\TyposquattingChecker settings",
                        "Microsoft Edge\\TyposquattingChecker settings",
                        "Typosquatting Checker settings"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev96~Policy~microsoft_edge~TyposquattingChecker/TyposquattingCheckerEnabled",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled",
                    "categoryId": "2e241b46-e5ae-41d7-a559-fe40819e86f4",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled",
                    "description": "This policy setting lets you configure whether to turn on Edge TyposquattingChecker. Edge TyposquattingChecker provides warning messages to help protect your users from potential typosquatting sites. By default, Edge TyposquattingChecker is turned on.\r\n\r\nIf you enable this policy, Edge TyposquattingChecker is turned on.\r\n\r\nIf you disable this policy, Edge TyposquattingChecker is turned off.\r\n\r\nIf you don't configure this policy, Edge TyposquattingChecker is turned on but users can choose whether to use Edge TyposquattingChecker.",
                    "helpText": "",
                    "name": "TyposquattingCheckerEnabled",
                    "displayName": "Configure Edge Website Typo Protection",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge~typosquattingchecker_typosquattingcheckerenabled_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "10",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "7f882cda-1391-45a0-bea9-611d19c2cbb1"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "3614b1ed-85ca-4556-a093-21cacb4d03c0",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "InternetExplorerIntegrationReloadInIEModeAllowed",
                        "Allow unconfigured sites to be reloaded in Internet Explorer mode",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev92~Policy~microsoft_edge/InternetExplorerIntegrationReloadInIEModeAllowed",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed",
                    "description": "This policy allows users to reload unconfigured sites (that are not configured in the Enterprise Mode Site List) in Internet Explorer mode when browsing in Microsoft Edge and a site requires Internet Explorer for compatibility.\r\n\r\nAfter a site has been reloaded in Internet Explorer mode, \"in-page\" navigations will stay in Internet Explorer mode (for example, a link, script, or form on the page, or a server-side redirect from another \"in-page\" navigation). Users can choose to exit from Internet Explorer mode, or Microsoft Edge will automatically exit from Internet Explorer mode when a navigation that isn't \"in-page\" occurs (for example, using the address bar, the back button, or a favorite link).\r\n\r\nUsers can also optionally tell Microsoft Edge to use Internet Explorer mode for the site in the future. This choice will be remembered for a length of time managed by the 'InternetExplorerIntegrationLocalSiteListExpirationDays' (Specify the number of days that a site remains on the local IE mode site list) policy.\r\n\r\nIf the 'InternetExplorerIntegrationLevel' (Configure Internet Explorer integration) policy is set to 'IEMode', then sites explicitly configured by the 'InternetExplorerIntegrationSiteList' (Configure the Enterprise Mode Site List) policy's site list to use Microsoft Edge can't be reloaded in Internet Explorer mode, and sites configured by the site list or by the 'SendIntranetToInternetExplorer' (Send all intranet sites to Internet Explorer) policy to use Internet Explorer mode can't exit from Internet Explorer mode.\r\n\r\nIf you enable this policy, users are allowed to reload unconfigured sites in Internet Explorer mode.\r\n\r\nIf you disable this policy, users aren't allowed to reload unconfigured sites in Internet Explorer mode.\r\n\r\nNote that if you enable this policy, it takes precedence over how you configured the 'InternetExplorerIntegrationTestingAllowed' (Allow Internet Explorer mode testing) policy, and that policy will be disabled.\r\n\r\nTo learn more about Internet Explorer mode, see https://go.microsoft.com/fwlink/?linkid=2094210",
                    "helpText": "",
                    "name": "InternetExplorerIntegrationReloadInIEModeAllowed",
                    "displayName": "Allow unconfigured sites to be reloaded in Internet Explorer mode",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev92~policy~microsoft_edge_internetexplorerintegrationreloadiniemodeallowed_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "11",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "165783d7-e9e4-4f8d-851c-017162497b81"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "b165ab66-5a07-42be-b42e-9607190c4053",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "SSLErrorOverrideAllowed",
                        "Allow users to proceed from the HTTPS warning page",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge/SSLErrorOverrideAllowed",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed",
                    "description": "Microsoft Edge shows a warning page when users visit sites that have SSL errors.\r\n\r\nIf you enable or don't configure (default) this policy, users can click through these warning pages.\r\n\r\nIf you disable this policy, users are blocked from clicking through any warning page.",
                    "helpText": "",
                    "name": "SSLErrorOverrideAllowed",
                    "displayName": "Allow users to proceed from the HTTPS warning page",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_sslerroroverrideallowed_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "12",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "57a25f73-fd61-40d7-a8a3-f8b976a5a0e3"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "8478b691-af31-4b41-ba55-7818ceb947bd",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "InternetExplorerIntegrationZoneIdentifierMhtFileAllowed",
                        "Automatically open downloaded MHT or MHTML files from the web in Internet Explorer mode",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev117~Policy~microsoft_edge/InternetExplorerIntegrationZoneIdentifierMhtFileAllowed",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed",
                    "description": "This policy controls whether MHT or MHTML files that are downloaded from the web are automatically opened in Internet Explorer mode.\r\n\r\nIf you enable this policy, the MHT or MHTML files that are downloaded from the web can be opened in both Microsoft Edge and Internet Explorer mode to provide the best user experience.\r\n\r\nIf you disable or don't configure this policy, MHT or MHTML files that are downloaded from the web won't automatically open in Internet Explorer mode.\r\n\r\nTo learn more about Internet Explorer mode, see https://go.microsoft.com/fwlink/?linkid=2094210",
                    "helpText": "",
                    "name": "InternetExplorerIntegrationZoneIdentifierMhtFileAllowed",
                    "displayName": "Automatically open downloaded MHT or MHTML files from the web in Internet Explorer mode",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev117~policy~microsoft_edge_internetexplorerintegrationzoneidentifiermhtfileallowed_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "13",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "7c825904-acd9-40cf-82cb-5d14eb0c7367"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "1ff75ff2-8c0f-45e7-9133-a2d6b915e782",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_dynamiccodesettings",
                            "settingInstanceTemplateReference": {
                                "settingInstanceTemplateId": "6edbc641-3108-46b4-8c7a-b8ab340a652b"
                            },
                            "choiceSettingValue": {
                                "value": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_dynamiccodesettings_0",
                                "settingValueTemplateReference": {
                                    "settingValueTemplateId": "90dcb447-496d-4868-8037-bc4bb0b1dd68",
                                    "useTemplateDefault": false
                                },
                                "children": []
                            }
                        }
                    ]
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "DynamicCodeSettings",
                        "Dynamic Code Settings",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev128~Policy~microsoft_edge/DynamicCodeSettings",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings",
                    "description": "This policy controls the dynamic code settings for Microsoft Edge.\r\n\r\nDisabling dynamic code improves the security of Microsoft Edge by preventing potentially hostile dynamic code and third-party code from making changes to Microsoft Edge's behavior. However this might cause compatibility issues with third-party software that must run in the browser process.\r\n\r\nIf you set this policy to 0 (the default) or leave unset, then Microsoft Edge will use the default settings.\r\n\r\nIf you set this policy to 1 – (EnabledForBrowser) then the Microsoft Edge browser process is prevented from creating dynamic code.\r\n\r\nPolicy options mapping:\r\n\r\n* Default (0) = Default dynamic code settings\r\n\r\n* EnabledForBrowser (1) = Prevent the browser process from creating dynamic code\r\n\r\nUse the preceding information when configuring this policy.",
                    "helpText": "",
                    "name": "DynamicCodeSettings",
                    "displayName": "Dynamic Code Settings",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": [
                                {
                                    "dependedOnBy": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_dynamiccodesettings",
                                    "required": true
                                }
                            ]
                        }
                    ]
                },
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "DynamicCodeSettings",
                        "Dynamic Code Settings",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev128~Policy~microsoft_edge/DynamicCodeSettings",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "default",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_dynamiccodesettings",
                    "description": "",
                    "helpText": "",
                    "name": "DynamicCodeSettings",
                    "displayName": "Dynamic Code Settings (Device)",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_dynamiccodesettings_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_dynamiccodesettings_0",
                            "description": null,
                            "helpText": null,
                            "name": "Default dynamic code settings",
                            "displayName": "Default dynamic code settings",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "0"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_1",
                                    "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings"
                                }
                            ],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_dynamiccodesettings_1",
                            "description": null,
                            "helpText": null,
                            "name": "Prevent the browser process from creating dynamic code",
                            "displayName": "Prevent the browser process from creating dynamic code",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "1"
                            },
                            "dependentOn": [
                                {
                                    "dependentOn": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings_1",
                                    "parentSettingId": "device_vendor_msft_policy_config_microsoft_edgev128~policy~microsoft_edge_dynamiccodesettings"
                                }
                            ],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "14",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev128.1~policy~microsoft_edge_applicationboundencryptionenabled",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "c57a423b-54ba-4369-9d38-41ebda91aa8a"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev128.1~policy~microsoft_edge_applicationboundencryptionenabled_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "0758a458-c64b-409e-bd31-57768aba3b5b",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "ApplicationBoundEncryptionEnabled",
                        "Enable Application Bound Encryption",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev128.1~Policy~microsoft_edge/ApplicationBoundEncryptionEnabled",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev128.1~policy~microsoft_edge_applicationboundencryptionenabled",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev128.1~policy~microsoft_edge_applicationboundencryptionenabled",
                    "description": "Enabling this policy or leaving it unset binds the encryption keys used for local data storage to Microsoft Edge whenever possible.\r\n\r\nDisabling this policy has a detrimental effect on Microsoft Edge's security because unknown and potentially hostile apps can retrieve the encryption keys used to secure data.\r\n\r\nOnly turn off this policy if there are compatibility issues, such as scenarios where other applications need legitimate access to Microsoft Edge's data. Encrypted user data is expected to be fully portable between different computers or the integrity and location of Microsoft Edge's executable files isn’t consistent.",
                    "helpText": "",
                    "name": "ApplicationBoundEncryptionEnabled",
                    "displayName": "Enable Application Bound Encryption",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev128.1~policy~microsoft_edge_applicationboundencryptionenabled_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev128.1~policy~microsoft_edge_applicationboundencryptionenabled_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev128.1~policy~microsoft_edge_applicationboundencryptionenabled_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "15",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "9a678b14-190d-42af-990f-8e7124c9af78"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "4c1ece3a-5e11-4aeb-a82c-69f227293394",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "BrowserLegacyExtensionPointsBlockingEnabled",
                        "Enable browser legacy extension point blocking",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev95~Policy~microsoft_edge/BrowserLegacyExtensionPointsBlockingEnabled",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled",
                    "description": "Sets the ProcessExtensionPointDisablePolicy on Microsoft Edge's browser process to block code injection from legacy third party applications.\r\n\r\nIf you enable or don't configure this policy, the ProcessExtensionPointDisablePolicy is applied to block legacy extension points in the browser process.\r\n\r\nIf you disable this policy, the ProcessExtensionPointDisablePolicy is not applied to block legacy extension points in the browser process. This has a detrimental effect on Microsoft Edge's security and stability as unknown and potentially hostile code can load inside Microsoft Edge's browser process. Only turn off the policy if there are compatibility issues with third-party software that must run inside Microsoft Edge's browser process.",
                    "helpText": "",
                    "name": "BrowserLegacyExtensionPointsBlockingEnabled",
                    "displayName": "Enable browser legacy extension point blocking",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge_browserlegacyextensionpointsblockingenabled_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "16",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "f826b165-0b22-4d05-b1e1-d0470a78bf4a"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "a759b657-83f4-43ac-a8a6-2c040d5df842",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "SitePerProcess",
                        "Enable site isolation for every site",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edge~Policy~microsoft_edge/SitePerProcess",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess",
                    "description": "\r\nThe 'SitePerProcess' policy can be used to prevent users from opting out of the default behavior of isolating all sites. Note that you can also use the 'IsolateOrigins' (Enable site isolation for specific origins) policy to isolate additional, finer-grained origins.\r\nIf you enable this policy, users can't opt out of the default behavior where each site runs in its own process.\r\nIf you disable or don’t configure this policy, a user can opt out of site isolation.  (For example, by using \"Disable site isolation\" entry in edge://flags.)  Disabling the policy or not configuring the policy doesn't turn off Site Isolation.\r\n",
                    "helpText": "",
                    "name": "SitePerProcess",
                    "displayName": "Enable site isolation for every site",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge_siteperprocess_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "17",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "84e05adb-804f-434d-9849-a59a61bdf9ef"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "672fda68-bd24-46f5-9ec5-98b7fbb64607",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "InternetExplorerModeToolbarButtonEnabled",
                        "Show the Reload in Internet Explorer mode button in the toolbar",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev96~Policy~microsoft_edge/InternetExplorerModeToolbarButtonEnabled",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled",
                    "description": "Set this policy to show the Reload in Internet Explorer mode button in the toolbar. Users can hide the button in the toolbar through edge://settings/appearance.  The button will only be shown on the toolbar when the 'InternetExplorerIntegrationReloadInIEModeAllowed' (Allow unconfigured sites to be reloaded in Internet Explorer mode) policy is enabled or if the user has chosen to enable \"Allow sites to be reloaded in Internet Explorer mode\".\r\n\r\nIf you enable this policy, the Reload in Internet mode button is pinned to the toolbar.\r\n\r\nIf you disable or don't configure this policy, the Reload in Internet Explorer mode button isn't shown in the toolbar by default. Users can toggle the Show Internet Explorer mode button in edge://settings/appearance.",
                    "helpText": "",
                    "name": "InternetExplorerModeToolbarButtonEnabled",
                    "displayName": "Show the Reload in Internet Explorer mode button in the toolbar",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev96~policy~microsoft_edge_internetexplorermodetoolbarbuttonenabled_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "18",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "83e120ac-df8e-47ae-9a2d-d3c327018405"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed_0",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "91954c3e-3694-4c56-9448-8ff680e5877d",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            },
            "settingDefinitions": [
                {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingDefinition",
                    "accessTypes": "none",
                    "keywords": [
                        "SharedArrayBufferUnrestrictedAccessAllowed",
                        "Specifies whether SharedArrayBuffers can be used in a non cross-origin-isolated context",
                        "\\Microsoft Edge",
                        "Microsoft Edge"
                    ],
                    "infoUrls": [],
                    "baseUri": "./Device/Vendor/MSFT/Policy",
                    "offsetUri": "/Config/microsoft_edgev111~Policy~microsoft_edge/SharedArrayBufferUnrestrictedAccessAllowed",
                    "rootDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed",
                    "categoryId": "a25a7a02-4bac-411b-9d02-10cb3297cb17",
                    "settingUsage": "configuration",
                    "uxBehavior": "toggle",
                    "visibility": "settingsCatalog,template",
                    "riskLevel": "low",
                    "id": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed",
                    "description": "Specifies whether SharedArrayBuffers can be used in a non cross-origin-isolated context.  A SharedArrayBuffer is a binary data buffer that can be used to create views on shared memory.  SharedArrayBuffers have a memory access vulnerability in several popular CPUs.\r\n\r\nIf you enable this policy, sites are allowed to use SharedArrayBuffers with no restrictions.\r\n\r\nIf you disable or don't configure this policy, sites are allowed to use SharedArrayBuffers only when cross-origin isolated.\r\n\r\nMicrosoft Edge will require cross-origin isolation when using SharedArrayBuffers from Microsoft Edge 91 onward for Web Compatibility reasons.",
                    "helpText": "",
                    "name": "SharedArrayBufferUnrestrictedAccessAllowed",
                    "displayName": "Specifies whether SharedArrayBuffers can be used in a non cross-origin-isolated context",
                    "version": "638917477006998785",
                    "defaultOptionId": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed_0",
                    "applicability": {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationWindowsSettingApplicability",
                        "description": null,
                        "platform": "windows10",
                        "deviceMode": "none",
                        "technologies": "mdm",
                        "configurationServiceProviderVersion": "5.0",
                        "maximumSupportedVersion": null,
                        "minimumSupportedVersion": null,
                        "windowsSkus": [],
                        "requiresAzureAd": false,
                        "requiredAzureAdTrustType": "none"
                    },
                    "occurrence": {
                        "minDeviceOccurrence": 1,
                        "maxDeviceOccurrence": 1
                    },
                    "referredSettingInformationList": [],
                    "options": [
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed_0",
                            "description": null,
                            "helpText": null,
                            "name": "Disabled",
                            "displayName": "Disabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 0
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        },
                        {
                            "itemId": "device_vendor_msft_policy_config_microsoft_edgev111~policy~microsoft_edge_sharedarraybufferunrestrictedaccessallowed_1",
                            "description": null,
                            "helpText": null,
                            "name": "Enabled",
                            "displayName": "Enabled",
                            "optionValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference": null,
                                "value": 1
                            },
                            "dependentOn": [],
                            "dependedOnBy": []
                        }
                    ]
                }
            ]
        }
    ]
}